; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v7 - type_3 ?v3 - type_2)
 	      (pred_4 ?v8 - object ?v3 - type_2)
	      (pred_3 ?v7 - type_3 ?v1 - type_1)
	      (pred_2 ?v7 - type_3 ?v8 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v7 - type_3 ?v2 ?v5 - type_2)
       :precondition (and  (pred_1 ?v7 ?v2))
       :effect (and  (pred_1 ?v7 ?v5)
		     (not (pred_1 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_3 ?v4 - object ?v6 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v6) (pred_1 ?v7 ?v6) (pred_3 ?v7 ?v1))
       :effect (and (pred_2 ?v7 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v6)) 
		    (not (pred_3 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_3 ?v4 - object ?v6 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v4 ?v1) (pred_1 ?v7 ?v6))
       :effect (and (pred_4 ?v4 ?v6)
		    (pred_3 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v4 ?v1)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_06 obj_07 - type_3
obj_04 obj_03 obj_11 obj_01 - type_1
obj_09 obj_08 obj_10 - type_2
obj_02 obj_05 - object)
(:init
(pred_1 obj_06 obj_09)
(pred_3 obj_06 obj_04)
(pred_3 obj_06 obj_03)
(pred_1 obj_07 obj_09)
(pred_3 obj_07 obj_11)
(pred_3 obj_07 obj_01)
(pred_4 obj_02 obj_09)
(pred_4 obj_05 obj_10)
)
(:goal
(and
(pred_4 obj_02 obj_09)
(pred_4 obj_05 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_06 obj_10)))
)
)

; plan
1. (op_2 obj_07 obj_09 obj_10)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_10)
   goals met: 1 of 2
2. (op_1 obj_07 obj_05 obj_10 obj_01)
   deleted: (pred_4 obj_05 obj_10) (pred_3 obj_07 obj_01)
   added: (pred_2 obj_07 obj_05 obj_01)
   goals met: 1 of 2
3. (op_2 obj_07 obj_10 obj_09)
   deleted: (pred_1 obj_07 obj_10)
   added: (pred_1 obj_07 obj_09)
   goals met: 1 of 2
4. (op_3 obj_07 obj_05 obj_09 obj_01)
   deleted: (pred_2 obj_07 obj_05 obj_01)
   added: (pred_4 obj_05 obj_09) (pred_3 obj_07 obj_01)
   goals met: 2 of 2
